---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetPartAncillaryUsage
source: html/dcd90020-8b5e-0d73-8de4-923ef0a4ba14.htm
---
# Autodesk.Revit.DB.FabricationPart.GetPartAncillaryUsage Method

Gets a list of all ancillary usage information for the part.

## Syntax (C#)
```csharp
public IList<FabricationAncillaryUsage> GetPartAncillaryUsage()
```

## Returns
Returns array of usage information, one per unique type of ancillary used.